Table of Contents
 Class LoadCase
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load case in the model
[OpenModelClass("CI.StructModel.Loading.LoadCase,CI.Loading", "CI.StructModel.Loading.ILoadCase,CI.BasicTypes")]
public class LoadCase : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LoadCase
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create a load case.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
//Load case
LoadCase loadCase = new LoadCase();
loadCase.Name = "LC1";
loadCase.LoadType = LoadCaseType.Permanent;
loadCase.Type = LoadCaseSubType.PermanentStandard;
loadCase.Variable = VariableType.NotSet;
loadCase.LoadGroup = new ReferenceElement(loadGroup);
openModel.AddObject(loadCase);
Constructors
 LoadCase()
Constructor
public LoadCase()
Properties
 Description
Additional info
public string Description { get; set; }
Property Value
string
 LoadGroup
Load group
public ReferenceElement LoadGroup { get; set; }
Property Value
ReferenceElement
 LoadType
Load case type
public LoadCaseType LoadType { get; set; }
Property Value
LoadCaseType
 LoadsInPoint
List of point load impulses in this load case
public List<ReferenceElement> LoadsInPoint { get; set; }
Property Value
List<ReferenceElement>
 LoadsOnLine
List of line load impulses in this load case
public List<ReferenceElement> LoadsOnLine { get; set; }
Property Value
List<ReferenceElement>
 LoadsOnSurface
List surafce load in this load case
public List<ReferenceElement> LoadsOnSurface { get; set; }
Property Value
List<ReferenceElement>
 Name
Name of load case
public string Name { get; set; }
Property Value
string
 PointLoadsOnLine
List of point load impulses in this load case
public List<ReferenceElement> PointLoadsOnLine { get; set; }
Property Value
List<ReferenceElement>
 Settlements
Settlements in this load case
public List<ReferenceElement> Settlements { get; set; }
Property Value
List<ReferenceElement>
 StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.
public List<ReferenceElement> StrainLoadsOnLine { get; set; }
Property Value
List<ReferenceElement>
 TemperatureLoadsOnLine
List of temperature load in this load case
public List<ReferenceElement> TemperatureLoadsOnLine { get; set; }
Property Value
List<ReferenceElement>
 Type
Sub type
public LoadCaseSubType Type { get; set; }
Property Value
LoadCaseSubType
 Variable
Variable type
public VariableType Variable { get; set; }
Property Value
VariableType
 Edit this page